StarterHacksProject-master/app/controllers/policies_controller.rb

SELECT "policies".* FROM "policies"
---
	def index
		@policies = Policy.all

INSERT INTO "policies" ("title", "description", "policymakers", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdf"], ["description", "adsf"], ["policymakers", "adsf"], ["location", "asdf"], ["created_at", "2018-03-04 03:53:05.550353"], ["updated_at", "2018-03-04 03:53:05.550353"]]
---
	def create
		@policy = Policy.new(article_params)

		@policy.save

SELECT  "policies".* FROM "policies" WHERE "policies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@policy = Policy.find(params[:id])